## Agenda




  - **Installation of pandas** ✅ 
    - `Importing pandas`✅ 
    - `Importing the dataset` ✅ 
    - `Dataframe/Series` ✅
   
  
  - **Basic ops on a DataFrame**✅  
    - `df.info()` ✅
    - `df.head()` ✅
    - `df.tail()`✅ 
    - `df.shape` ✅
    - `df.describe()`✅
    
  
  - **Basic ops on columns** ✅ 
    - `Different ways of accessing cols`✅ 
    - `Check for Unique values`✅
    - `Rename column`✅
    - `Deleting col`✅
    - `Creating new cols`✅
    
  
  - **Basic ops on rows** ✅
    - `Implicit/explicit index`✅
    - `df.index`✅
    - `Indexing in series`✅
    - `Slicing in series`✅
    - `loc/iloc`✅      
    - `Indexing/Slicing in dataframe`✅
    - `Adding a row`✅
    - `Deleting a row`
    - `Check for duplicates`
  
  
  - **Working with both rows and columns**✅
  
  
  - **More in-built ops in pandas** 
    - `sum()`
    - `count()`
    - `mean()`

  
  - **Sorting** 

  
  - **Concatenation** 
    - `pd.concat()`
    - `axis` for concat

  
  - **Merge**
    - Concat v/s Merge
    - `left_on` and `right_on`
    - Joins

  
  - **Intoduction to IMDB dataset**
    - Reading two datasets

## **Installation of pandas**

### `Importing pandas`

In [1]:
!pip install pandas

Requirement already satisfied: pandas in /Users/nikhilsanghi/opt/anaconda3/lib/python3.9/site-packages (1.3.4)
Requirement already satisfied: python-dateutil>=2.7.3 in /Users/nikhilsanghi/opt/anaconda3/lib/python3.9/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2017.3 in /Users/nikhilsanghi/opt/anaconda3/lib/python3.9/site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.17.3 in /Users/nikhilsanghi/opt/anaconda3/lib/python3.9/site-packages (from pandas) (1.20.3)
Requirement already satisfied: six>=1.5 in /Users/nikhilsanghi/opt/anaconda3/lib/python3.9/site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

In [3]:
import numpy as np
import pandas as pd

### `Importing the dataset`

In [4]:
df=pd.read_csv("/Users/nikhilsanghi/Downloads/01_dsml-course-main-live/batches/2_Sept_Beg_Tue_Oct_Beg_Tue/08_Pandas_2/mckinsey.csv")
df

          country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [4]:
type(df)

pandas.core.frame.DataFrame

### `Dataframe/Series`

#### 1. Row Oriented Approach

In [7]:
df1=pd.DataFrame([["Afghanistan",1952,8425333,"Asia",28.801,779.445314],
              ["Afghanistan",1957,9240934,"Asia",30.332,820.853030]],
                columns=["country","year","population","continent","life_exp","gdp_cap"])
df1

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030

#### 2. Column Oriented Approach

In [9]:
df2=pd.DataFrame({
    "country":["Afghanistan","Afghanistan"],
    "year":[1952,1957],
    "population":[8425333,9240934],
    "continent":["Asia","Asia"],
    "life_exp":[28.801,30.332],
    "gdp_cap":[779.445314,820.853030],
    
})
df2

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030

## **Basic ops on a DataFrame**

### `df.info()`

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   country     1704 non-null   object
 1   year        1704 non-null   int64
 2   population  1704 non-null   int64
 3   continent   1704 non-null   object
 4   life_exp    1704 non-null   float64
 5   gdp_cap     1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

### `df.describe()`

In [16]:
df.describe()

             year    population     life_exp        gdp_cap
count  1704.00000  1.704000e+03  1704.000000    1704.000000
mean   1979.50000  2.960121e+07    59.474439    7215.327081
std      17.26533  1.061579e+08    12.917107    9857.454543
min    1952.00000  6.001100e+04    23.599000     241.165876
25%    1965.75000  2.793664e+06    48.198000    1202.060309
50%    1979.50000  7.023596e+06    60.712500    3531.846988
75%    1993.25000  1.958522e+07    70.845500    9325.462346
max    2007.00000  1.318683e+09    82.603000  113523.132900

In [17]:
df.describe(include="object")

            country continent
count          1704      1704
unique          142         5
top     Afghanistan    Africa
freq             12       624

In [18]:
df.describe(include="all")

,country,year,population,continent,life_exp,gdp_cap
count,1704,1704.00000,1.704000e+03,1704,1704.000000,1704.000000
unique,142,NaN,NaN,5,NaN,NaN
top,Afghanistan,NaN,NaN,Africa,NaN,NaN
freq,12,NaN,NaN,624,NaN,NaN
mean,NaN,1979.50000,2.960121e+07,NaN,59.474439,7215.327081
std,NaN,17.26533,1.061579e+08,NaN,12.917107,9857.454543
min,NaN,1952.00000,6.001100e+04,NaN,23.599000,241.165876
25%,NaN,1965.75000,2.793664e+06,NaN,48.198000,1202.060309
50%,NaN,1979.50000,7.023596e+06,NaN,60.712500,3531.846988
75%,NaN,1993.25000,1.958522e+07,NaN,70.845500,9325.462346
max,NaN,2007.00000,1.318683e+09,NaN,82.603000,113523.132900

### `df.head()`

In [10]:
df.head()

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [11]:
df.head(10)

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106
5  Afghanistan  1977    14880372      Asia    38.438  786.113360
6  Afghanistan  1982    12881816      Asia    39.854  978.011439
7  Afghanistan  1987    13867957      Asia    40.822  852.395945
8  Afghanistan  1992    16317921      Asia    41.674  649.341395
9  Afghanistan  1997    22227415      Asia    41.763  635.341351

### `df.tail()`

In [12]:
df.tail()

       country  year  population continent  life_exp     gdp_cap
1699  Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700  Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701  Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702  Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703  Zimbabwe  2007    12311143    Africa    43.487  469.709298

In [13]:
df.tail(10)

       country  year  population continent  life_exp     gdp_cap
1694  Zimbabwe  1962     4277736    Africa    52.358  527.272182
1695  Zimbabwe  1967     4995432    Africa    53.995  569.795071
1696  Zimbabwe  1972     5861135    Africa    55.635  799.362176
1697  Zimbabwe  1977     6642107    Africa    57.674  685.587682
1698  Zimbabwe  1982     7636524    Africa    60.363  788.855041
1699  Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700  Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701  Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702  Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703  Zimbabwe  2007    12311143    Africa    43.487  469.709298

### `df.shape`

In [14]:
df.shape

(1704, 6)

## **Basic ops on columns**

### `Accessing Column Names`

In [30]:
df.keys()

Index(['country', 'year', 'population', 'continent', 'life_exp', 'gdp_cap'], dtype='object')

In [31]:
df.columns

Index(['country', 'year', 'population', 'continent', 'life_exp', 'gdp_cap'], dtype='object')

### `Different ways of accessing cols`

In [19]:
df

          country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [20]:
df["country"] # method 1  # recommended

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [21]:
type(df["country"])

pandas.core.series.Series

In [23]:
df[["country","year"]]

          country  year
0     Afghanistan  1952
1     Afghanistan  1957
2     Afghanistan  1962
3     Afghanistan  1967
4     Afghanistan  1972
...           ...   ...
1699     Zimbabwe  1987
1700     Zimbabwe  1992
1701     Zimbabwe  1997
1702     Zimbabwe  2002
1703     Zimbabwe  2007

[1704 rows x 2 columns]

In [24]:
# method 2 # not recommended
df.country

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [ ]:
# df.max
# df.country name 
# df.1
# df.country,year

### `Check for Unique values`

In [26]:
df["continent"].unique()

array(['Asia', 'Europe', 'Africa', 'Americas', 'Oceania'], dtype=object)

In [27]:
df["continent"].nunique()

5

In [28]:
df["continent"].value_counts()

Africa      624
Asia        396
Europe      360
Americas    300
Oceania      24
Name: continent, dtype: int64

### `Rename column`

In [29]:
df.head()

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [36]:

#method 1 
df.rename({"country":"Country"},axis=1)

          Country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [37]:
#method 2 
df.rename(columns={"country":"Country"})

          Country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [38]:
df.head()

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [39]:
# Method 1 ( preferrable)
df.rename({"country":"Country"},axis=1,inplace=True)

In [40]:
df.head()

       Country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [41]:
# Method 2
df=df.rename({"year":"Year"},axis=1)

In [42]:
df.head()

       Country  Year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [43]:
# Method 1 ( preferrable)
df.rename(columns={"population":"Population"},inplace=True)

In [44]:
df.head()

       Country  Year  Population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [45]:
# Method 2
df=df.rename(columns={"life_exp":"Life_exp"})

In [46]:
df.head()

       Country  Year  Population continent  Life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [52]:
df.rename(columns={"country":"Country",
                   "year":"Year",
                   "continent":"Continent",
                   "population":"Population",
                   "life_exp":"Life_exp",
                   "gdp_cap":"Gdp_cap"
                  },inplace=True)

In [53]:
df.head()

       Country  Year  Population Continent  Life_exp     Gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

### `Deleting col`

In [54]:
df.head()

       Country  Year  Population Continent  Life_exp     Gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [61]:
# Method 1 
df.drop(["Continent"],axis=1)

          Country  Year  Population  Life_exp     Gdp_cap
0     Afghanistan  1952     8425333    28.801  779.445314
1     Afghanistan  1957     9240934    30.332  820.853030
2     Afghanistan  1962    10267083    31.997  853.100710
3     Afghanistan  1967    11537966    34.020  836.197138
4     Afghanistan  1972    13079460    36.088  739.981106
...           ...   ...         ...       ...         ...
1699     Zimbabwe  1987     9216418    62.351  706.157306
1700     Zimbabwe  1992    10704340    60.377  693.420786
1701     Zimbabwe  1997    11404948    46.809  792.449960
1702     Zimbabwe  2002    11926563    39.989  672.038623
1703     Zimbabwe  2007    12311143    43.487  469.709298

[1704 rows x 5 columns]

In [62]:
# Method 2 
df.drop(columns=["Population"])

          Country  Year Continent  Life_exp     Gdp_cap
0     Afghanistan  1952      Asia    28.801  779.445314
1     Afghanistan  1957      Asia    30.332  820.853030
2     Afghanistan  1962      Asia    31.997  853.100710
3     Afghanistan  1967      Asia    34.020  836.197138
4     Afghanistan  1972      Asia    36.088  739.981106
...           ...   ...       ...       ...         ...
1699     Zimbabwe  1987    Africa    62.351  706.157306
1700     Zimbabwe  1992    Africa    60.377  693.420786
1701     Zimbabwe  1997    Africa    46.809  792.449960
1702     Zimbabwe  2002    Africa    39.989  672.038623
1703     Zimbabwe  2007    Africa    43.487  469.709298

[1704 rows x 5 columns]

In [65]:
# Method 1 
df.drop(["Continent","Year"],axis=1,inplace=True)

          Country  Population  Life_exp     Gdp_cap
0     Afghanistan     8425333    28.801  779.445314
1     Afghanistan     9240934    30.332  820.853030
2     Afghanistan    10267083    31.997  853.100710
3     Afghanistan    11537966    34.020  836.197138
4     Afghanistan    13079460    36.088  739.981106
...           ...         ...       ...         ...
1699     Zimbabwe     9216418    62.351  706.157306
1700     Zimbabwe    10704340    60.377  693.420786
1701     Zimbabwe    11404948    46.809  792.449960
1702     Zimbabwe    11926563    39.989  672.038623
1703     Zimbabwe    12311143    43.487  469.709298

[1704 rows x 4 columns]

### `Creating new cols`

In [66]:
df.head()

       Country  Year  Population Continent  Life_exp     Gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [67]:
df["Year+7"]=df["Year"]+7

In [68]:
df.head()

       Country  Year  Population Continent  Life_exp     Gdp_cap  Year+7
0  Afghanistan  1952     8425333      Asia    28.801  779.445314    1959
1  Afghanistan  1957     9240934      Asia    30.332  820.853030    1964
2  Afghanistan  1962    10267083      Asia    31.997  853.100710    1969
3  Afghanistan  1967    11537966      Asia    34.020  836.197138    1974
4  Afghanistan  1972    13079460      Asia    36.088  739.981106    1979

In [69]:
df["Year+Gdp_cap"]=df["Year"]+df["Gdp_cap"]
df.head()

,Country,Year,Population,Continent,Life_exp,Gdp_cap,Year+7,Year+Gdp_cap
0,Afghanistan,1952,8425333,Asia,28.801,779.445314,1959,2731.445314
1,Afghanistan,1957,9240934,Asia,30.332,820.853030,1964,2777.853030
2,Afghanistan,1962,10267083,Asia,31.997,853.100710,1969,2815.100710
3,Afghanistan,1967,11537966,Asia,34.020,836.197138,1974,2803.197138
4,Afghanistan,1972,13079460,Asia,36.088,739.981106,1979,2711.981106

In [70]:
df["Year+Gdp_cap"]=df["Year"]
df.head()

,Country,Year,Population,Continent,Life_exp,Gdp_cap,Year+7,Year+Gdp_cap
0,Afghanistan,1952,8425333,Asia,28.801,779.445314,1959,1952
1,Afghanistan,1957,9240934,Asia,30.332,820.853030,1964,1957
2,Afghanistan,1962,10267083,Asia,31.997,853.100710,1969,1962
3,Afghanistan,1967,11537966,Asia,34.020,836.197138,1974,1967
4,Afghanistan,1972,13079460,Asia,36.088,739.981106,1979,1972

In [72]:
# df["Country+Gdp_cap"]=df["Country"]+df["Gdp_cap"]
df.head()

,Country,Year,Population,Continent,Life_exp,Gdp_cap,Year+7,Year+Gdp_cap
0,Afghanistan,1952,8425333,Asia,28.801,779.445314,1959,1952
1,Afghanistan,1957,9240934,Asia,30.332,820.853030,1964,1957
2,Afghanistan,1962,10267083,Asia,31.997,853.100710,1969,1962
3,Afghanistan,1967,11537966,Asia,34.020,836.197138,1974,1967
4,Afghanistan,1972,13079460,Asia,36.088,739.981106,1979,1972

In [73]:
df["Country+Continent"]=df["Country"]+"-"+df["Continent"]
df.head()

,Country,Year,Population,Continent,Life_exp,Gdp_cap,Year+7,Year+Gdp_cap,Country+Continent
0,Afghanistan,1952,8425333,Asia,28.801,779.445314,1959,1952,Afghanistan-Asia
1,Afghanistan,1957,9240934,Asia,30.332,820.853030,1964,1957,Afghanistan-Asia
2,Afghanistan,1962,10267083,Asia,31.997,853.100710,1969,1962,Afghanistan-Asia
3,Afghanistan,1967,11537966,Asia,34.020,836.197138,1974,1967,Afghanistan-Asia
4,Afghanistan,1972,13079460,Asia,36.088,739.981106,1979,1972,Afghanistan-Asia

In [5]:
df

          country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [7]:
len([ i for i in range(1,1705)])

1704

In [8]:
# Creating a new column using our own data
df["own_data"] = [ i for i in range(1,1705)]

In [9]:
df

          country  year  population continent  life_exp     gdp_cap  own_data
0     Afghanistan  1952     8425333      Asia    28.801  779.445314         1
1     Afghanistan  1957     9240934      Asia    30.332  820.853030         2
2     Afghanistan  1962    10267083      Asia    31.997  853.100710         3
3     Afghanistan  1967    11537966      Asia    34.020  836.197138         4
4     Afghanistan  1972    13079460      Asia    36.088  739.981106         5
...           ...   ...         ...       ...       ...         ...       ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306      1700
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786      1701
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960      1702
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623      1703
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298      1704

[1704 rows x 7 columns]

In [15]:
l=[ i for i in range(1,1704)]
# print(l)

In [22]:
# df["own_data_1"] = [ i for i in range(1,1704)]

##   **Basic ops on rows**

### `df.index`

In [23]:
df

          country  year  population continent  life_exp     gdp_cap  own_data
0     Afghanistan  1952     8425333      Asia    28.801  779.445314         1
1     Afghanistan  1957     9240934      Asia    30.332  820.853030         2
2     Afghanistan  1962    10267083      Asia    31.997  853.100710         3
3     Afghanistan  1967    11537966      Asia    34.020  836.197138         4
4     Afghanistan  1972    13079460      Asia    36.088  739.981106         5
...           ...   ...         ...       ...       ...         ...       ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306      1700
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786      1701
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960      1702
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623      1703
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298      1704

[1704 rows x 7 columns]

In [25]:
df.index.values

array([   0,    1,    2, ..., 1701, 1702, 1703])

### `Implicit/explicit index`

In [26]:
a=pd.Series(["a","b","c","d","e","f","g","h","i"])
a

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
8    i
dtype: object

In [29]:
b=pd.Series(["a","b","c","d","e","f","g","h","i"],
           index=[1,2,3,4,5,6,7,8,9])
b

1    a
2    b
3    c
4    d
5    e
6    f
7    g
8    h
9    i
dtype: object

In [37]:
c=pd.Series(["a","b","c","d","e","f","g","h","i"],
           index=[1.0,2.0,3.0,4.0,5.0,6.0,7.0,8.0,9.0])
c

1.0    a
2.0    b
3.0    c
4.0    d
5.0    e
6.0    f
7.0    g
8.0    h
9.0    i
dtype: object

In [38]:
d=pd.Series(["a","b","c","d","e","f","g","h","i"],
           index=["a","b","c","d","e","f","g","h","i"])
d

a    a
b    b
c    c
d    d
e    e
f    f
g    g
h    h
i    i
dtype: object

### `Indexing in series`

In [32]:
a

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
8    i
dtype: object

In [33]:
a[3]

'd'

In [34]:
b

1    a
2    b
3    c
4    d
5    e
6    f
7    g
8    h
9    i
dtype: object

In [35]:
b[4]

'd'

In [39]:
c

1.0    a
2.0    b
3.0    c
4.0    d
5.0    e
6.0    f
7.0    g
8.0    h
9.0    i
dtype: object

In [40]:
c[4.0]

'd'

In [41]:
d

a    a
b    b
c    c
d    d
e    e
f    f
g    g
h    h
i    i
dtype: object

In [42]:
d["d"]

'd'

In [ ]:
# indexing uses Explicit indexes

### `Slicing in series`

In [43]:
a

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
8    i
dtype: object

In [44]:
a[3:7]

3    d
4    e
5    f
6    g
dtype: object

In [45]:
b

1    a
2    b
3    c
4    d
5    e
6    f
7    g
8    h
9    i
dtype: object

In [46]:
b[4:8]

5    e
6    f
7    g
8    h
dtype: object

In [47]:
b[3:7]

4    d
5    e
6    f
7    g
dtype: object

In [48]:
c

1.0    a
2.0    b
3.0    c
4.0    d
5.0    e
6.0    f
7.0    g
8.0    h
9.0    i
dtype: object

In [49]:
c[1.0:3.0]

1.0    a
2.0    b
3.0    c
dtype: object

In [50]:
d

a    a
b    b
c    c
d    d
e    e
f    f
g    g
h    h
i    i
dtype: object

In [51]:
d["a":"c"]

a    a
b    b
c    c
dtype: object

In [54]:
d[0:3]

a    a
b    b
c    c
dtype: object

### `loc/iloc`

In [56]:
# .loc --> Always Use Explicit Indexes
# .iloc --> Always Use Implicit Indexes

In [57]:
a

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
8    i
dtype: object

In [58]:
a.loc[3]

'd'

In [59]:
a.iloc[3]

'd'

In [60]:
a.iloc[3:7]

3    d
4    e
5    f
6    g
dtype: object

In [61]:
a

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
8    i
dtype: object

In [62]:
a.loc[3:7]

3    d
4    e
5    f
6    g
7    h
dtype: object

In [63]:
b

1    a
2    b
3    c
4    d
5    e
6    f
7    g
8    h
9    i
dtype: object

In [64]:
b.loc[4]

'd'

In [65]:
b.iloc[3]

'd'

In [66]:
b.loc[4:7]

4    d
5    e
6    f
7    g
dtype: object

In [67]:
b.iloc[3:7]

4    d
5    e
6    f
7    g
dtype: object

In [68]:
c

1.0    a
2.0    b
3.0    c
4.0    d
5.0    e
6.0    f
7.0    g
8.0    h
9.0    i
dtype: object

In [69]:
c.loc[4.0]

'd'

In [70]:
c.loc[4] # forget this

'd'

In [71]:
c.iloc[3]

'd'

In [72]:
c

1.0    a
2.0    b
3.0    c
4.0    d
5.0    e
6.0    f
7.0    g
8.0    h
9.0    i
dtype: object

In [73]:
c.loc[4.0:7.0]

4.0    d
5.0    e
6.0    f
7.0    g
dtype: object

In [74]:
c.iloc[3:7]

4.0    d
5.0    e
6.0    f
7.0    g
dtype: object

In [75]:
d

a    a
b    b
c    c
d    d
e    e
f    f
g    g
h    h
i    i
dtype: object

In [77]:
d.loc["d"]

'd'

In [83]:
# d.loc[3] # errors

In [78]:
d.iloc[3]

'd'

In [81]:
# d.iloc["d"]# errors

In [84]:
d

a    a
b    b
c    c
d    d
e    e
f    f
g    g
h    h
i    i
dtype: object

In [85]:
d.loc["d":"g"]

d    d
e    e
f    f
g    g
dtype: object

In [86]:
d.iloc[3:7]

d    d
e    e
f    f
g    g
dtype: object

In [88]:
d

a    a
b    b
c    c
d    d
e    e
f    f
g    g
h    h
i    i
dtype: object

In [90]:
d.loc["d":"h":2]

d    d
f    f
h    h
dtype: object

In [91]:
d.iloc[3:8:2]

d    d
f    f
h    h
dtype: object

In [92]:
d

a    a
b    b
c    c
d    d
e    e
f    f
g    g
h    h
i    i
dtype: object

In [93]:
d.loc["d":"h":-1]

Series([], dtype: object)

In [94]:
d.loc["h":"d":-1]

h    h
g    g
f    f
e    e
d    d
dtype: object

In [95]:
b

1    a
2    b
3    c
4    d
5    e
6    f
7    g
8    h
9    i
dtype: object

In [96]:
b.iloc[-2:-5:-2]

8    h
6    f
dtype: object

In [101]:
b.iloc[-1:-3:-1]

9    i
8    h
dtype: object

In [104]:
b=pd.Series(["a","b","c"],
           index=["-1","-2","-3"])
b

-1    a
-2    b
-3    c
dtype: object

### `Indexing/Slicing in dataframe`

### `Adding a row`

In [112]:
df

          country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [105]:
new_row={"country":"India",
        "year":2023,
        "population":140000000,
        "continent":"Asia",
        "life_exp":61.9,
        "gdp_cap":2000.4324,
        }

In [116]:
df=df.append(new_row,ignore_index=True)

In [117]:
df

          country  year  population continent  life_exp      gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801   779.445314
1     Afghanistan  1957     9240934      Asia    30.332   820.853030
2     Afghanistan  1962    10267083      Asia    31.997   853.100710
3     Afghanistan  1967    11537966      Asia    34.020   836.197138
4     Afghanistan  1972    13079460      Asia    36.088   739.981106
...           ...   ...         ...       ...       ...          ...
1700     Zimbabwe  1992    10704340    Africa    60.377   693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809   792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989   672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487   469.709298
1704        India  2023   140000000      Asia    61.900  2000.432400

[1705 rows x 6 columns]

In [118]:
# 2nd method

In [119]:
["India",2023,140000000,"Asia",61.9,2000.4324]

['India', 2023, 140000000, 'Asia', 61.9, 2000.4324]

In [120]:
df.iloc[1704]

country           India
year               2023
population    140000000
continent          Asia
life_exp           61.9
gdp_cap       2000.4324
Name: 1704, dtype: object

In [121]:
df.loc[1704]

country           India
year               2023
population    140000000
continent          Asia
life_exp           61.9
gdp_cap       2000.4324
Name: 1704, dtype: object

In [122]:
df.shape[0]

1705

In [123]:
df.loc[1705]=["India",2023,140000000,"Asia",61.9,2000.4324]

In [124]:
df

          country  year  population continent  life_exp      gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801   779.445314
1     Afghanistan  1957     9240934      Asia    30.332   820.853030
2     Afghanistan  1962    10267083      Asia    31.997   853.100710
3     Afghanistan  1967    11537966      Asia    34.020   836.197138
4     Afghanistan  1972    13079460      Asia    36.088   739.981106
...           ...   ...         ...       ...       ...          ...
1701     Zimbabwe  1997    11404948    Africa    46.809   792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989   672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487   469.709298
1704        India  2023   140000000      Asia    61.900  2000.432400
1705        India  2023   140000000      Asia    61.900  2000.432400

[1706 rows x 6 columns]

In [125]:
df.loc[df.shape[0]]=["India",2023,140000000,"Asia",61.9,2000.4324]

In [126]:
df

          country  year  population continent  life_exp      gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801   779.445314
1     Afghanistan  1957     9240934      Asia    30.332   820.853030
2     Afghanistan  1962    10267083      Asia    31.997   853.100710
3     Afghanistan  1967    11537966      Asia    34.020   836.197138
4     Afghanistan  1972    13079460      Asia    36.088   739.981106
...           ...   ...         ...       ...       ...          ...
1702     Zimbabwe  2002    11926563    Africa    39.989   672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487   469.709298
1704        India  2023   140000000      Asia    61.900  2000.432400
1705        India  2023   140000000      Asia    61.900  2000.432400
1706        India  2023   140000000      Asia    61.900  2000.432400

[1707 rows x 6 columns]

In [127]:
df.loc[1800]=["India",2024,140000000,"Asia",62,2000.4324]

In [128]:
df

          country  year  population continent  life_exp      gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801   779.445314
1     Afghanistan  1957     9240934      Asia    30.332   820.853030
2     Afghanistan  1962    10267083      Asia    31.997   853.100710
3     Afghanistan  1967    11537966      Asia    34.020   836.197138
4     Afghanistan  1972    13079460      Asia    36.088   739.981106
...           ...   ...         ...       ...       ...          ...
1703     Zimbabwe  2007    12311143    Africa    43.487   469.709298
1704        India  2023   140000000      Asia    61.900  2000.432400
1705        India  2023   140000000      Asia    61.900  2000.432400
1706        India  2023   140000000      Asia    61.900  2000.432400
1800        India  2024   140000000      Asia    62.000  2000.432400

[1708 rows x 6 columns]

In [129]:
df.tail(10)

       country  year  population continent  life_exp      gdp_cap
1698  Zimbabwe  1982     7636524    Africa    60.363   788.855041
1699  Zimbabwe  1987     9216418    Africa    62.351   706.157306
1700  Zimbabwe  1992    10704340    Africa    60.377   693.420786
1701  Zimbabwe  1997    11404948    Africa    46.809   792.449960
1702  Zimbabwe  2002    11926563    Africa    39.989   672.038623
1703  Zimbabwe  2007    12311143    Africa    43.487   469.709298
1704     India  2023   140000000      Asia    61.900  2000.432400
1705     India  2023   140000000      Asia    61.900  2000.432400
1706     India  2023   140000000      Asia    61.900  2000.432400
1800     India  2024   140000000      Asia    62.000  2000.432400

In [130]:
df.loc[1702]=["India",2024,140000000,"Asia",62,2000.4324]

In [131]:
df.tail(10)

       country  year  population continent  life_exp      gdp_cap
1698  Zimbabwe  1982     7636524    Africa    60.363   788.855041
1699  Zimbabwe  1987     9216418    Africa    62.351   706.157306
1700  Zimbabwe  1992    10704340    Africa    60.377   693.420786
1701  Zimbabwe  1997    11404948    Africa    46.809   792.449960
1702     India  2024   140000000      Asia    62.000  2000.432400
1703  Zimbabwe  2007    12311143    Africa    43.487   469.709298
1704     India  2023   140000000      Asia    61.900  2000.432400
1705     India  2023   140000000      Asia    61.900  2000.432400
1706     India  2023   140000000      Asia    61.900  2000.432400
1800     India  2024   140000000      Asia    62.000  2000.432400

In [ ]:
df.iloc[1702]=["India",2024,140000000,"Asia",62,2000.4324]

In [134]:
df.iloc[1707]

country           India
year               2024
population    140000000
continent          Asia
life_exp           62.0
gdp_cap       2000.4324
Name: 1800, dtype: object

In [135]:
df.loc[df.shape[0]]=["India",2024,140000000,"Asia",62,2000.4324]

In [136]:
df

          country  year  population continent  life_exp      gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801   779.445314
1     Afghanistan  1957     9240934      Asia    30.332   820.853030
2     Afghanistan  1962    10267083      Asia    31.997   853.100710
3     Afghanistan  1967    11537966      Asia    34.020   836.197138
4     Afghanistan  1972    13079460      Asia    36.088   739.981106
...           ...   ...         ...       ...       ...          ...
1704        India  2023   140000000      Asia    61.900  2000.432400
1705        India  2023   140000000      Asia    61.900  2000.432400
1706        India  2023   140000000      Asia    61.900  2000.432400
1800        India  2024   140000000      Asia    62.000  2000.432400
1708        India  2024   140000000      Asia    62.000  2000.432400

[1709 rows x 6 columns]

In [ ]:
df.iloc[df.shape[0]]=["India",2024,140000000,"Asia",62,2000.4324]

In [137]:
df.shape[0]

1709

In [141]:
df.loc[df.shape[0]]=["India",2024,140000000,"Asia",62,2000.4324]

In [142]:
df

          country  year  population continent  life_exp      gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801   779.445314
1     Afghanistan  1957     9240934      Asia    30.332   820.853030
2     Afghanistan  1962    10267083      Asia    31.997   853.100710
3     Afghanistan  1967    11537966      Asia    34.020   836.197138
4     Afghanistan  1972    13079460      Asia    36.088   739.981106
...           ...   ...         ...       ...       ...          ...
1705        India  2023   140000000      Asia    61.900  2000.432400
1706        India  2023   140000000      Asia    61.900  2000.432400
1800        India  2024   140000000      Asia    62.000  2000.432400
1708        India  2024   140000000      Asia    62.000  2000.432400
1709        India  2024   140000000      Asia    62.000  2000.432400

[1710 rows x 6 columns]

In [144]:
df.tail(10)

       country  year  population continent  life_exp      gdp_cap
1700  Zimbabwe  1992    10704340    Africa    60.377   693.420786
1701  Zimbabwe  1997    11404948    Africa    46.809   792.449960
1702     India  2024   140000000      Asia    62.000  2000.432400
1703  Zimbabwe  2007    12311143    Africa    43.487   469.709298
1704     India  2023   140000000      Asia    61.900  2000.432400
1705     India  2023   140000000      Asia    61.900  2000.432400
1706     India  2023   140000000      Asia    61.900  2000.432400
1800     India  2024   140000000      Asia    62.000  2000.432400
1708     India  2024   140000000      Asia    62.000  2000.432400
1709     India  2024   140000000      Asia    62.000  2000.432400

In [ ]:
df.loc[df.shape[0]]=["Sri lanka",2024,140000000,"Asia",62,2000.4324]

In [145]:
df.iloc[1706]=["Sri lanka",2024,140000000,"Asia",62,2000.4324]

In [147]:
df.tail(10)

        country  year  population continent  life_exp      gdp_cap
1700   Zimbabwe  1992    10704340    Africa    60.377   693.420786
1701   Zimbabwe  1997    11404948    Africa    46.809   792.449960
1702      India  2024   140000000      Asia    62.000  2000.432400
1703   Zimbabwe  2007    12311143    Africa    43.487   469.709298
1704      India  2023   140000000      Asia    61.900  2000.432400
1705      India  2023   140000000      Asia    61.900  2000.432400
1706  Sri lanka  2024   140000000      Asia    62.000  2000.432400
1800      India  2024   140000000      Asia    62.000  2000.432400
1708      India  2024   140000000      Asia    62.000  2000.432400
1709      India  2024   140000000      Asia    62.000  2000.432400

In [148]:
df.loc[1706]=["Sri",2024,140000000,"Asia",62,2000.4324]

In [149]:
df

          country  year  population continent  life_exp      gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801   779.445314
1     Afghanistan  1957     9240934      Asia    30.332   820.853030
2     Afghanistan  1962    10267083      Asia    31.997   853.100710
3     Afghanistan  1967    11537966      Asia    34.020   836.197138
4     Afghanistan  1972    13079460      Asia    36.088   739.981106
...           ...   ...         ...       ...       ...          ...
1705        India  2023   140000000      Asia    61.900  2000.432400
1706          Sri  2024   140000000      Asia    62.000  2000.432400
1800        India  2024   140000000      Asia    62.000  2000.432400
1708        India  2024   140000000      Asia    62.000  2000.432400
1709        India  2024   140000000      Asia    62.000  2000.432400

[1710 rows x 6 columns]

In [150]:
df.loc[1800]

country           India
year               2024
population    140000000
continent          Asia
life_exp           62.0
gdp_cap       2000.4324
Name: 1800, dtype: object

In [151]:
df

          country  year  population continent  life_exp      gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801   779.445314
1     Afghanistan  1957     9240934      Asia    30.332   820.853030
2     Afghanistan  1962    10267083      Asia    31.997   853.100710
3     Afghanistan  1967    11537966      Asia    34.020   836.197138
4     Afghanistan  1972    13079460      Asia    36.088   739.981106
...           ...   ...         ...       ...       ...          ...
1705        India  2023   140000000      Asia    61.900  2000.432400
1706          Sri  2024   140000000      Asia    62.000  2000.432400
1800        India  2024   140000000      Asia    62.000  2000.432400
1708        India  2024   140000000      Asia    62.000  2000.432400
1709        India  2024   140000000      Asia    62.000  2000.432400

[1710 rows x 6 columns]

In [152]:
df.loc[1705:1708]

     country  year  population continent  life_exp    gdp_cap
1705   India  2023   140000000      Asia      61.9  2000.4324
1706     Sri  2024   140000000      Asia      62.0  2000.4324
1800   India  2024   140000000      Asia      62.0  2000.4324
1708   India  2024   140000000      Asia      62.0  2000.4324

In [153]:
df.iloc[1705:1709]

     country  year  population continent  life_exp    gdp_cap
1705   India  2023   140000000      Asia      61.9  2000.4324
1706     Sri  2024   140000000      Asia      62.0  2000.4324
1800   India  2024   140000000      Asia      62.0  2000.4324
1708   India  2024   140000000      Asia      62.0  2000.4324

In [154]:
df.loc[1705:1708,"year":"life_exp"]

      year  population continent  life_exp
1705  2023   140000000      Asia      61.9
1706  2024   140000000      Asia      62.0
1800  2024   140000000      Asia      62.0
1708  2024   140000000      Asia      62.0

In [156]:
df.loc[[1706,1800,1708],"year":"life_exp"]

      year  population continent  life_exp
1706  2024   140000000      Asia      62.0
1800  2024   140000000      Asia      62.0
1708  2024   140000000      Asia      62.0

In [161]:
df.loc[[1706,1800,1708],["year","life_exp"]]

      year  life_exp
1706  2024      62.0
1800  2024      62.0
1708  2024      62.0

In [162]:
df.loc[1706:1708,["year","life_exp"]]

      year  life_exp
1706  2024      62.0
1800  2024      62.0
1708  2024      62.0

In [157]:
df.iloc[[1706,1707,1708],1:5]

      year  population continent  life_exp
1706  2024   140000000      Asia      62.0
1800  2024   140000000      Asia      62.0
1708  2024   140000000      Asia      62.0

In [159]:
df.loc[1702:1800,"year":"life_exp"]

      year  population continent  life_exp
1702  2024   140000000      Asia    62.000
1703  2007    12311143    Africa    43.487
1704  2023   140000000      Asia    61.900
1705  2023   140000000      Asia    61.900
1706  2024   140000000      Asia    62.000
1800  2024   140000000      Asia    62.000

In [160]:
df.iloc[1702:1708,1:5]

      year  population continent  life_exp
1702  2024   140000000      Asia    62.000
1703  2007    12311143    Africa    43.487
1704  2023   140000000      Asia    61.900
1705  2023   140000000      Asia    61.900
1706  2024   140000000      Asia    62.000
1800  2024   140000000      Asia    62.000

In [158]:
df.tail(10)

       country  year  population continent  life_exp      gdp_cap
1700  Zimbabwe  1992    10704340    Africa    60.377   693.420786
1701  Zimbabwe  1997    11404948    Africa    46.809   792.449960
1702     India  2024   140000000      Asia    62.000  2000.432400
1703  Zimbabwe  2007    12311143    Africa    43.487   469.709298
1704     India  2023   140000000      Asia    61.900  2000.432400
1705     India  2023   140000000      Asia    61.900  2000.432400
1706       Sri  2024   140000000      Asia    62.000  2000.432400
1800     India  2024   140000000      Asia    62.000  2000.432400
1708     India  2024   140000000      Asia    62.000  2000.432400
1709     India  2024   140000000      Asia    62.000  2000.432400

In [163]:
df.loc[[1702,1704,1706,1708],["life_exp","gdp_cap","year"]]

      life_exp    gdp_cap  year
1702      62.0  2000.4324  2024
1704      61.9  2000.4324  2023
1706      62.0  2000.4324  2024
1708      62.0  2000.4324  2024

In [164]:
df.loc[1702:1708:2,["life_exp","gdp_cap","year"]]

      life_exp    gdp_cap  year
1702      62.0  2000.4324  2024
1704      61.9  2000.4324  2023
1706      62.0  2000.4324  2024
1708      62.0  2000.4324  2024

In [165]:
df.tail(10)

       country  year  population continent  life_exp      gdp_cap
1700  Zimbabwe  1992    10704340    Africa    60.377   693.420786
1701  Zimbabwe  1997    11404948    Africa    46.809   792.449960
1702     India  2024   140000000      Asia    62.000  2000.432400
1703  Zimbabwe  2007    12311143    Africa    43.487   469.709298
1704     India  2023   140000000      Asia    61.900  2000.432400
1705     India  2023   140000000      Asia    61.900  2000.432400
1706       Sri  2024   140000000      Asia    62.000  2000.432400
1800     India  2024   140000000      Asia    62.000  2000.432400
1708     India  2024   140000000      Asia    62.000  2000.432400
1709     India  2024   140000000      Asia    62.000  2000.432400

In [166]:
df.iloc[1702:1709:2,[4,5,1]]

      life_exp    gdp_cap  year
1702      62.0  2000.4324  2024
1704      61.9  2000.4324  2023
1706      62.0  2000.4324  2024
1708      62.0  2000.4324  2024

In [167]:
df.iloc[1702:1709:2,1:6]

      year  population continent  life_exp    gdp_cap
1702  2024   140000000      Asia      62.0  2000.4324
1704  2023   140000000      Asia      61.9  2000.4324
1706  2024   140000000      Asia      62.0  2000.4324
1708  2024   140000000      Asia      62.0  2000.4324

In [170]:
df.iloc[1702:1709:2,[1,5]]

      year    gdp_cap
1702  2024  2000.4324
1704  2023  2000.4324
1706  2024  2000.4324
1708  2024  2000.4324

### `Deleting a row`

### `Check for duplicates`

## **Working with both rows and columns**

## **More in-built ops in pandas**

## **Sorting**

## **Concatenation**

## **Merge**

## **Introduction to IMDB dataset**